NexellCorp/android_hal_pyrope/ogl_4330/src/opengles/m200_backend/gles_m200_rsw.h
/*
 * This confidential and proprietary software may be used only as
 * authorised by a licensing agreement from ARM Limited
 * (C) COPYRIGHT 2006-2012 ARM Limited
 * ALL RIGHTS RESERVED
 * The entire notice above must be reproduced on all authorised
 * copies and copies may only be made to the extent permitted
 * by a licensing agreement from ARM Limited.
 */

#ifndef GLES_M200_RSW_H
#define GLES_M200_RSW_H

#include <mali_system.h>
#include <gles_context.h>
#include <gles_util.h>

#include <mali_rsw.h>
#include "gles_m200_rsw_map.h"

#include "shared/m200_gp_frame_builder.h"
#include "shared/m200_gp_frame_builder_inlines.h"


enum rsw_enable_bit
{
	M200_ALPHA_TEST,
	M200_DEPTH_TEST,
	M200_BLEND,
	M200_COLOR_LOGIC_OP,
	M200_STENCIL_TEST,
	M200_MULTISAMPLE,
	M200_SAMPLE_COVERAGE,
	M200_POLYGON_OFFSET_FILL,
	M200_LINE_SMOOTH,
	M200_POINT_SMOOTH,
	M200_SAMPLE_ALPHA_TO_COVERAGE,
	M200_SAMPLE_ALPHA_TO_ONE,
	M200_DEPTH_MASK,
	M200_RSW_MULTISAMPLE_INVERT,
	M200_RSW_DITHER,
};

typedef struct mali_rsw_raster
{
	m200_rsw mirror;

	/* Enable/Disable functionality requires we overwrite bits in the RSW.
	 * As a result of this, we need to store some redundant data here for
	 * restoring state when Enable is called
	 */
	u32 enable_bits;

	u8 alpha_func;
	u8 alpha_ref;

	u8 blend_mode_rgb;
	u8 blend_mode_alpha;
	u8 blend_src;
	u8 blend_dst;
	u8 blend_alpha_src;
	u8 blend_alpha_dst;
	u8 color_logic_op;

	u8 depth_func;

	u8 front_stencil_func;
	u32 front_stencil_ref;
	u32 front_stencil_mask;
	u32 front_stencil_write_mask;
	u8 front_stencil_sfail;
	u8 front_stencil_zfail;
	u8 front_stencil_zpass;

	u8 back_stencil_func;
	u32 back_stencil_ref;
	u32 back_stencil_mask;
	u32 back_stencil_write_mask;
	u8 back_stencil_sfail;
	u8 back_stencil_zfail;
	u8 back_stencil_zpass;

	mali_float multisample_coverage;
	u8 polygon_offset_factor;
	u8 polygon_offset_units;

	/* Lossy encoding in RSW's requires redundant data for API Gets
	 * functionality
	 */
	GLclampf opengl_blend_r;
	GLclampf opengl_blend_g;
	GLclampf opengl_blend_b;
	GLclampf opengl_blend_a;

	GLclampf opengl_alpha_ref;

	GLfloat opengl_polygon_offset_factor;
	GLfloat opengl_polygon_offset_units;

	GLuint opengl_front_stencil_mask;
	GLuint opengl_back_stencil_mask;

} mali_rsw_raster;

MALI_STATIC_FORCE_INLINE mali_bool _gles_fb_enables_get( mali_rsw_raster *rsw_raster, enum rsw_enable_bit which )
{
	/* Note: This must return 1 or 0, as the result is used directly to encode
	 *       RSW's, hence the downshift and mask
	 */
	return ( rsw_raster->enable_bits >> which ) & 1U;
}

MALI_STATIC_FORCE_INLINE void _gles_fb_enables_set( mali_rsw_raster *rsw_raster, enum rsw_enable_bit which, u32 value )
{
	MALI_DEBUG_ASSERT( value == 0 || value == 1, ("ill conditioned bit vector value") );
	rsw_raster->enable_bits &= ~( 1U << which );
	rsw_raster->enable_bits |= value << which;
}


MALI_STATIC_INLINE void _gles_fb_blend_color( gles_context *ctx, GLclampf r, GLclampf g, GLclampf b, GLclampf a, mali_bool fp16_format  )
{
    mali_rsw_raster *rsw = ctx->rsw_raster;
        
    rsw->opengl_blend_r = CLAMP( r, 0.0f, 1.0f );
    rsw->opengl_blend_g = CLAMP( g, 0.0f, 1.0f );
    rsw->opengl_blend_b = CLAMP( b, 0.0f, 1.0f );
    rsw->opengl_blend_a = CLAMP( a, 0.0f, 1.0f );

    if (!fp16_format)
    {
       __m200_rsw_encode( &rsw->mirror, M200_RSW_CONSTANT_BLEND_COLOR_RED,   (u8)(rsw->opengl_blend_r * MALI_U8_MAX) );
       __m200_rsw_encode( &rsw->mirror, M200_RSW_CONSTANT_BLEND_COLOR_GREEN, (u8)(rsw->opengl_blend_g * MALI_U8_MAX) );
       __m200_rsw_encode( &rsw->mirror, M200_RSW_CONSTANT_BLEND_COLOR_BLUE,  (u8)(rsw->opengl_blend_b * MALI_U8_MAX) );
       __m200_rsw_encode( &rsw->mirror, M200_RSW_CONSTANT_BLEND_COLOR_ALPHA, (u8)(rsw->opengl_blend_a * MALI_U8_MAX) );
   }
   else
   {
       __m200_rsw_encode(  &rsw->mirror, M200_RSW_CONSTANT_BLEND_COLOR_RED,   _gles_fp32_to_fp16_predefined(rsw->opengl_blend_r) );
       __m200_rsw_encode(  &rsw->mirror, M200_RSW_CONSTANT_BLEND_COLOR_GREEN, _gles_fp32_to_fp16_predefined (rsw->opengl_blend_g));
       __m200_rsw_encode(  &rsw->mirror, M200_RSW_CONSTANT_BLEND_COLOR_BLUE,  _gles_fp32_to_fp16_predefined (rsw->opengl_blend_b));
       __m200_rsw_encode(  &rsw->mirror, M200_RSW_CONSTANT_BLEND_COLOR_ALPHA, _gles_fp32_to_fp16_predefined (rsw->opengl_blend_a));       
    }

}

/**
 * Sets the blend equation.
 */
void _gles_fb_blend_equation( gles_context *ctx, u8 mode_rgb, u8 mode_alpha );

/**
 * Applies the dither setting to the RSW word, conditional on Logic_op and tile buffer format.
 */
void _gles_fb_init_apply_dither( gles_context *ctx, mali_bool flag );
void _gles_fb_apply_dither( gles_context *ctx, mali_bool flag );


MALI_STATIC_INLINE u8 no_dst_alpha_fix_rgb( u8 mali_factor )
{
	switch( mali_factor )
	{
		case M200_RSW_BLEND_DST_ALPHA:           return M200_RSW_BLEND_ONE;
		case M200_RSW_BLEND_ONE_MINUS_DST_ALPHA: return M200_RSW_BLEND_ZERO;
		case M200_RSW_BLEND_SRC_ALPHA_SATURATE:  return M200_RSW_BLEND_ZERO;
	}
	return mali_factor;
}

MALI_STATIC_INLINE u8 no_dst_alpha_fix_alpha( u8 mali_factor )
{
	switch( mali_factor )
	{
		case M200_RSW_BLEND_ONE_MINUS_DST_ALPHA: return M200_RSW_BLEND_ZERO;
		case M200_RSW_BLEND_DST_ALPHA:
		case M200_RSW_BLEND_SRC_ALPHA_SATURATE:  return M200_RSW_BLEND_ONE;
	}
	return mali_factor;
}


MALI_STATIC_INLINE void _gles_fb_init_blend_func( gles_context *ctx, u8 src, u8 dst, u8 alpha_src, u8 alpha_dst )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	rsw->blend_src = src;
	rsw->blend_dst = dst;
	rsw->blend_alpha_src = alpha_src;
	rsw->blend_alpha_dst = alpha_dst;

	/* Disabled blending is encoded as 1 * Cs + 0 * Cd */
	src = alpha_src = M200_RSW_BLEND_ONE;
	dst = alpha_dst = M200_RSW_BLEND_ZERO;

	/* Set the blend operation again as it may have been overwritten by a logic op
	 */
	_gles_fb_blend_equation( ctx, rsw->blend_mode_rgb, rsw->blend_mode_alpha );

	/* If the egl surface has alpha, we must change blend operations as Mali
	 * always has destination alpha internally. */
	src = no_dst_alpha_fix_rgb( src );
	dst = no_dst_alpha_fix_rgb( dst );
	alpha_src = no_dst_alpha_fix_alpha( alpha_src );
	alpha_dst = no_dst_alpha_fix_alpha( alpha_dst );

	/* alpha saturate (see OpenGL ES full spec 1.1.10 Table 4.1 for source alpha behavior)
	 * Note: this mapping must occur after the no_dst_alpha fixup.
	 */
	if( alpha_src == M200_RSW_BLEND_SRC_ALPHA_SATURATE ) alpha_src = M200_RSW_BLEND_ONE;

	/* Set blend functions, alpha blends are masked as they do not need to
	 * specify the alpha expand bit.
	 */
	__m200_rsw_encode( &rsw->mirror, M200_RSW_RGB_S_SOURCE_COMBINED, src );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_ALPHA_S_SOURCE_COMBINED, M200_RSW_ALPHA_BLEND_MASK & alpha_src );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_RGB_D_SOURCE_COMBINED, dst );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_ALPHA_D_SOURCE_COMBINED, M200_RSW_ALPHA_BLEND_MASK & alpha_dst );
}

MALI_STATIC_INLINE void _gles_fb_blend_func( gles_context *ctx, u8 src, u8 dst, u8 alpha_src, u8 alpha_dst )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	rsw->blend_src = src;
	rsw->blend_dst = dst;
	rsw->blend_alpha_src = alpha_src;
	rsw->blend_alpha_dst = alpha_dst;

	/* If logic op is enabled, we don't change the actual rendering behavior
	 */
	if( MALI_TRUE == _gles_fb_enables_get( rsw, M200_COLOR_LOGIC_OP ) ) return;

