NexellCorp/android_hal_pyrope/ogl_4330/src/opengles/m200_backend/gles_m200_rsw.h
	/* Disabled blending is encoded as 1 * Cs + 0 * Cd
	 */
	if( MALI_FALSE == _gles_fb_enables_get( rsw, M200_BLEND ) )
	{
		src = alpha_src = M200_RSW_BLEND_ONE;
		dst = alpha_dst = M200_RSW_BLEND_ZERO;
	}

	/* Set the blend operation again as it may have been overwritten by a logic op
	 */
	_gles_fb_blend_equation( ctx, rsw->blend_mode_rgb, rsw->blend_mode_alpha );

	/* If the egl surface has alpha, we must change blend operations as Mali
	 * always has destination alpha internally.
	 */
	if( 0 == _gles_fbo_get_bits( ctx->state.common.framebuffer.current_object, GL_ALPHA_BITS ) )
	{
		src = no_dst_alpha_fix_rgb( src );
		dst = no_dst_alpha_fix_rgb( dst );
		alpha_src = no_dst_alpha_fix_alpha( alpha_src );
		alpha_dst = no_dst_alpha_fix_alpha( alpha_dst );
	}

	/* alpha saturate (see OpenGL ES full spec 1.1.10 Table 4.1 for source alpha behavior)
	 * Note: this mapping must occur after the no_dst_alpha fixup.
	 */
	if( alpha_src == M200_RSW_BLEND_SRC_ALPHA_SATURATE ) alpha_src = M200_RSW_BLEND_ONE;

	/* Set blend functions, alpha blends are masked as they do not need to
	 * specify the alpha expand bit.
	 */
	__m200_rsw_encode( &rsw->mirror, M200_RSW_RGB_S_SOURCE_COMBINED, src );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_ALPHA_S_SOURCE_COMBINED, M200_RSW_ALPHA_BLEND_MASK & alpha_src );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_RGB_D_SOURCE_COMBINED, dst );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_ALPHA_D_SOURCE_COMBINED, M200_RSW_ALPHA_BLEND_MASK & alpha_dst );
}

MALI_STATIC_INLINE void _gles_fb_set_blend( gles_context *ctx, mali_bool flag )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	_gles_fb_enables_set( rsw, M200_BLEND, flag );

	_gles_fb_blend_func( ctx, rsw->blend_src, rsw->blend_dst, rsw->blend_alpha_src, rsw->blend_alpha_dst );
}

MALI_STATIC_INLINE void _gles_fb_logic_op( gles_context *ctx, u8 logic_op )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	rsw->color_logic_op = logic_op;

	/* Logic op has no RSW "default", behavior falls back to a blending op
	 */
	if( MALI_TRUE != _gles_fb_enables_get( rsw, M200_COLOR_LOGIC_OP ) ) return;

	/* this is done as we may be switching from blending mode and need to
	 * re-set the logic op function */
	__m200_rsw_encode( &rsw->mirror, M200_RSW_RGB_BLEND_FUNC, M200_BLEND_LOGICOP_MODE );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_ALPHA_BLEND_FUNC, M200_BLEND_LOGICOP_MODE );

	__m200_rsw_encode( &rsw->mirror, M200_RSW_RGB_LOGIC_OP_TRUTH_TABLE,	logic_op );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_ALPHA_LOGIC_OP_TRUTH_TABLE, logic_op );
}

MALI_STATIC_INLINE void _gles_fb_set_color_logic_op( gles_context *ctx, mali_bool flag )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	_gles_fb_enables_set( rsw, M200_COLOR_LOGIC_OP, flag );

	/* Logic op overrides dither, with the complication that in some HW cases, Logic_op needs dither to be on */
	_gles_fb_apply_dither(ctx, _gles_fb_enables_get( rsw, M200_RSW_DITHER ));

	/*  Logic op overrides blend (see OpenGL ES full spec 1.1.12 Section 4.1.9)
	 */
	if( flag )
	{
		_gles_fb_logic_op( ctx, rsw->color_logic_op );
	}
	else
	{
		_gles_fb_blend_func( ctx, rsw->blend_src, rsw->blend_dst, rsw->blend_alpha_src, rsw->blend_alpha_dst );
	}
}

MALI_STATIC_INLINE void _gles_fb_color_mask( gles_context *ctx, mali_bool r, mali_bool g, mali_bool b, mali_bool a )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	__m200_rsw_encode( &rsw->mirror, M200_RSW_R_WRITE_MASK, r );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_G_WRITE_MASK, g );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_B_WRITE_MASK, b );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_A_WRITE_MASK, a );
}

MALI_STATIC_INLINE void _gles_fb_polygon_offset_mali( gles_context *ctx, u8 factor, u8 units )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	MALI_IGNORE( units );

	rsw->polygon_offset_factor = factor;
	rsw->polygon_offset_units  = units;
}

MALI_STATIC_INLINE void _gles_fb_polygon_offset( gles_context *ctx, mali_float factor, mali_float units )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

#if HARDWARE_ISSUE_3713
	const u8 mali_factor = _gles_fp32_to_fixed_6_2( -factor );
#else
	const u8 mali_factor = _gles_fp32_to_fixed_6_2( factor );
#endif

	const u8 mali_units = 0;

	rsw->opengl_polygon_offset_factor = factor;
	rsw->opengl_polygon_offset_units  = units;

	_gles_fb_polygon_offset_mali( ctx, mali_factor, mali_units );
}

MALI_STATIC_INLINE void _gles_fb_polygon_offset_deferred( gles_context *ctx, mali_bool is_triangle_type )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	u8 factor = rsw->polygon_offset_factor;
	u8 units  = rsw->polygon_offset_units;

	if( MALI_FALSE == _gles_fb_enables_get( rsw, M200_POLYGON_OFFSET_FILL ) ||
	    MALI_FALSE == is_triangle_type )
	{
		factor = 0;
		units  = 0;
	}

	__m200_rsw_encode( &rsw->mirror, M200_RSW_POLYGON_Z_OFFSET_FACTOR, factor );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_POLYGON_Z_OFFSET_OFFSET, units );
}

MALI_STATIC_INLINE void _gles_fb_set_polygon_offset_fill( gles_context *ctx, mali_bool flag )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	_gles_fb_enables_set( rsw, M200_POLYGON_OFFSET_FILL, flag );

	_gles_fb_polygon_offset( ctx, rsw->opengl_polygon_offset_factor, rsw->opengl_polygon_offset_units );
}

MALI_STATIC_INLINE void _gles_fb_depth_range( gles_context *ctx, mali_float mali_near, mali_float mali_far )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	MALI_DEBUG_ASSERT( _mali_sys_isnan(mali_near) || _mali_sys_isnan(mali_far) || mali_near <= mali_far, ("Near/far plane ordering incorrect"));

	/* both mali_near and mali_far bound should be inclusive, so we round the mali_near bound down and the mali_far bound up */
	__m200_rsw_encode( &rsw->mirror, M200_RSW_Z_NEAR_BOUND, (u32)_mali_sys_floor( M200_RSW_Z_BOUND_MAX * mali_near ) );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_Z_FAR_BOUND,  (u32)_mali_sys_ceil( M200_RSW_Z_BOUND_MAX * mali_far ) );
}

/**
 * @return MALI_TRUE if depth test is enabled and there is a depth buffer present.
 */
MALI_STATIC_FORCE_INLINE mali_bool _gles_fb_depth_test_allowed( gles_context *ctx )
{
	/* While multisampling may be set to one it can be overridden by the
	 * buffer samples or this being a FBO which does not support them.
	 */
	mali_bool has_bits = _gles_fbo_get_bits( ctx->state.common.framebuffer.current_object, GL_DEPTH_BITS ) > 0;
	return _gles_fb_enables_get( ctx->rsw_raster, M200_DEPTH_TEST ) && has_bits;
}


