NexellCorp/android_hal_pyrope/ogl_4330/src/opengles/m200_backend/gles_m200_rsw.h
MALI_STATIC_INLINE void _gles_fb_init_depth_mask( gles_context *ctx, mali_bool mask )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	MALI_DEBUG_ASSERT( (0 == mask) || (1 == mask), ("Non-boolean value given for mask") );

	_gles_fb_enables_set( rsw, M200_DEPTH_MASK, mask );

	__m200_rsw_encode( &rsw->mirror, M200_RSW_Z_WRITE_MASK, 0 );
}

MALI_STATIC_INLINE void _gles_fb_depth_mask( gles_context *ctx, mali_bool mask )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	MALI_DEBUG_ASSERT( (0 == mask) || (1 == mask), ("Non-boolean value given for mask") );

	_gles_fb_enables_set( rsw, M200_DEPTH_MASK, mask );

	/* both glDisable( GL_DEPTH_TEST ) and glDepthMask impact depth writing
	 */
	__m200_rsw_encode( &rsw->mirror, M200_RSW_Z_WRITE_MASK, mask & _gles_fb_depth_test_allowed( ctx ) );
}

MALI_STATIC_INLINE void _gles_fb_init_depth_func( gles_context *ctx, u8 func )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	rsw->depth_func = func;

	__m200_rsw_encode( &rsw->mirror, M200_RSW_Z_COMPARE_FUNC, M200_TEST_ALWAYS_SUCCEED );
}

MALI_STATIC_INLINE void _gles_fb_depth_func( gles_context *ctx, u8 func )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	rsw->depth_func = func;

	/* glDisable( GL_DEPTH_TEST ) is encoded as the test always passing */
	if( MALI_FALSE == _gles_fb_depth_test_allowed( ctx ) )
	{
		func = M200_TEST_ALWAYS_SUCCEED;
	}

	__m200_rsw_encode( &rsw->mirror, M200_RSW_Z_COMPARE_FUNC, func );
}

MALI_STATIC_INLINE void _gles_fb_set_depth_test( gles_context *ctx, mali_bool flag )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	_gles_fb_enables_set( rsw, M200_DEPTH_TEST, flag );

	_gles_fb_depth_func( ctx, rsw->depth_func );
	_gles_fb_depth_mask( ctx, _gles_fb_enables_get( rsw, M200_DEPTH_MASK ) );
}

/**
 * @return MALI_TRUE if stencil test is enabled and there is a stencil buffer present.
 */
MALI_STATIC_FORCE_INLINE mali_bool _gles_fb_stencil_test_allowed( gles_context *ctx )
{
	/* While multisampling may be set to one it can be overridden by the
	 * buffer samples or this being a FBO which does not support them.
	 */
	mali_bool has_bits = _gles_fbo_get_bits( ctx->state.common.framebuffer.current_object, GL_STENCIL_BITS ) > 0;
	return _gles_fb_enables_get( ctx->rsw_raster, M200_STENCIL_TEST ) && has_bits;
}


#if HARDWARE_ISSUE_7585
MALI_STATIC_INLINE void _gles_fb_stencil_fixup_deferred( gles_context *ctx )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	if( _gles_fb_stencil_test_allowed( ctx ) )
	{
		u32 stencil_bits = _gles_fbo_get_bits( ctx->state.common.framebuffer.current_object, GL_STENCIL_BITS );
		stencil_bits = ( 1 << stencil_bits ) - 1;

		if( ( M200_TEST_NOT_EQUAL == rsw->front_stencil_func ) &&
		    ( M200_STENCIL_OP_KEEP_CURRENT == rsw->front_stencil_sfail ) &&
		    ( M200_STENCIL_OP_SET_TO_REFERENCE == rsw->front_stencil_zfail ) &&
		    ( M200_STENCIL_OP_SET_TO_REFERENCE == rsw->front_stencil_zpass ) &&
		    ( stencil_bits == (rsw->front_stencil_mask & GLES_MAX_STENCIL_MASK)) )
		{
			if( 0 == rsw->front_stencil_ref )
			{
				__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_FRONT_OP_IF_ZFAIL, M200_STENCIL_OP_SET_TO_ZERO );
				__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_FRONT_OP_IF_ZPASS, M200_STENCIL_OP_SET_TO_ZERO );
			}
			else
			{
				__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_FRONT_OP_IF_SFAIL, M200_STENCIL_OP_SET_TO_REFERENCE );
			}
		}

		if( ( M200_TEST_NOT_EQUAL == rsw->back_stencil_func ) &&
		    ( M200_STENCIL_OP_KEEP_CURRENT == rsw->back_stencil_sfail ) &&
		    ( M200_STENCIL_OP_SET_TO_REFERENCE == rsw->back_stencil_zfail ) &&
		    ( M200_STENCIL_OP_SET_TO_REFERENCE == rsw->back_stencil_zpass ) &&
		    ( stencil_bits == (rsw->back_stencil_mask & GLES_MAX_STENCIL_MASK) ) )
		{
			if( 0 == rsw->back_stencil_ref )
			{
				__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_BACK_OP_IF_ZFAIL, M200_STENCIL_OP_SET_TO_ZERO );
				__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_BACK_OP_IF_ZPASS, M200_STENCIL_OP_SET_TO_ZERO );
			}
			else
			{
				__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_BACK_OP_IF_SFAIL, M200_STENCIL_OP_SET_TO_REFERENCE );
			}
		}
	}
}
#endif

MALI_STATIC_INLINE void _gles_fb_init_front_stencil_func( gles_context *ctx, u8 func, u32 ref, GLuint mask )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	rsw->opengl_front_stencil_mask = mask;

	rsw->front_stencil_func = func;
	rsw->front_stencil_ref	= ref;
	rsw->front_stencil_mask = mask;

	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_FRONT_COMPARE_FUNC, M200_TEST_ALWAYS_SUCCEED );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_FRONT_REF_VALUE, ref & GLES_MAX_STENCIL_MASK );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_FRONT_OP_MASK, rsw->front_stencil_mask & GLES_MAX_STENCIL_MASK);
}

MALI_STATIC_INLINE void _gles_fb_front_stencil_func( gles_context *ctx, u8 func, u32 ref, GLuint mask )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	rsw->opengl_front_stencil_mask = mask;

	rsw->front_stencil_func = func;
	rsw->front_stencil_ref	= ref;
	rsw->front_stencil_mask = mask;

	if( MALI_FALSE == _gles_fb_stencil_test_allowed( ctx ) )
	{
		func = M200_TEST_ALWAYS_SUCCEED;
	}
	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_FRONT_COMPARE_FUNC, func );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_FRONT_REF_VALUE, ref & GLES_MAX_STENCIL_MASK );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_FRONT_OP_MASK, rsw->front_stencil_mask & GLES_MAX_STENCIL_MASK );
}

MALI_STATIC_INLINE void _gles_fb_init_back_stencil_func( gles_context *ctx, u8 func, u32 ref, GLuint mask )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	rsw->opengl_back_stencil_mask = mask;

	rsw->back_stencil_func = func;
	rsw->back_stencil_ref  = ref;
	rsw->back_stencil_mask = mask;

	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_BACK_COMPARE_FUNC, M200_TEST_ALWAYS_SUCCEED );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_BACK_REF_VALUE, ref & GLES_MAX_STENCIL_MASK );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_BACK_OP_MASK, rsw->back_stencil_mask & GLES_MAX_STENCIL_MASK);
}

MALI_STATIC_INLINE void _gles_fb_back_stencil_func( gles_context *ctx, u8 func, u32 ref, GLuint mask )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	rsw->opengl_back_stencil_mask = mask;

	rsw->back_stencil_func = func;
	rsw->back_stencil_ref  = ref;
	rsw->back_stencil_mask = mask;

	if( MALI_FALSE == _gles_fb_stencil_test_allowed( ctx ) )
	{
		func = M200_TEST_ALWAYS_SUCCEED;
	}
	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_BACK_COMPARE_FUNC, func );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_BACK_REF_VALUE, ref & GLES_MAX_STENCIL_MASK );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_BACK_OP_MASK, rsw->back_stencil_mask & GLES_MAX_STENCIL_MASK);
}

MALI_STATIC_INLINE void _gles_fb_init_front_stencil_op( gles_context *ctx, u8 sfail, u8 zfail, u8 zpass )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	rsw->front_stencil_sfail = sfail;
	rsw->front_stencil_zfail = zfail;
	rsw->front_stencil_zpass = zpass;

