NexellCorp/android_hal_pyrope/ogl_4330/src/opengles/m200_backend/gles_m200_rsw.h
	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_FRONT_OP_IF_SFAIL, sfail );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_FRONT_OP_IF_ZFAIL, M200_STENCIL_OP_KEEP_CURRENT );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_FRONT_OP_IF_ZPASS, M200_STENCIL_OP_KEEP_CURRENT );
}
MALI_STATIC_INLINE void _gles_fb_front_stencil_op( gles_context *ctx, u8 sfail, u8 zfail, u8 zpass )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	rsw->front_stencil_sfail = sfail;
	rsw->front_stencil_zfail = zfail;
	rsw->front_stencil_zpass = zpass;

	/* Z testing may be enabled with stencil being disabled so we must deal with
	 * such a possibility, sfail does not matter as the stencil test will always
	 * pass */
	if( MALI_FALSE == _gles_fb_stencil_test_allowed( ctx ) )
	{
		zfail = M200_STENCIL_OP_KEEP_CURRENT;
		zpass = M200_STENCIL_OP_KEEP_CURRENT;
	}
	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_FRONT_OP_IF_SFAIL, sfail );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_FRONT_OP_IF_ZFAIL, zfail );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_FRONT_OP_IF_ZPASS, zpass );
}

MALI_STATIC_INLINE void _gles_fb_init_back_stencil_op( gles_context *ctx, u8 sfail, u8 zfail, u8 zpass )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	rsw->back_stencil_sfail = sfail;
	rsw->back_stencil_zfail = zfail;
	rsw->back_stencil_zpass = zpass;

	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_BACK_OP_IF_SFAIL, sfail );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_BACK_OP_IF_ZFAIL, M200_STENCIL_OP_KEEP_CURRENT );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_BACK_OP_IF_ZPASS, M200_STENCIL_OP_KEEP_CURRENT );
}

MALI_STATIC_INLINE void _gles_fb_back_stencil_op( gles_context *ctx, u8 sfail, u8 zfail, u8 zpass )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	rsw->back_stencil_sfail = sfail;
	rsw->back_stencil_zfail = zfail;
	rsw->back_stencil_zpass = zpass;

	/* Z testing may be enabled with stencil being disabled so we must deal with
	 * such a possibility, sfail does not matter as the stencil test will always
	 * pass */
	if( MALI_FALSE == _gles_fb_stencil_test_allowed( ctx ) )
	{
		zfail = M200_STENCIL_OP_KEEP_CURRENT;
		zpass = M200_STENCIL_OP_KEEP_CURRENT;
	}
	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_BACK_OP_IF_SFAIL, sfail );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_BACK_OP_IF_ZFAIL, zfail );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_BACK_OP_IF_ZPASS, zpass );
}

MALI_STATIC_INLINE void _gles_fb_init_front_stencil_mask( gles_context *ctx, u32 mask )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	rsw->front_stencil_write_mask = mask;

	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_FRONT_WRITE_MASK, 0 );
}

MALI_STATIC_INLINE void _gles_fb_front_stencil_mask( gles_context *ctx, u32 mask )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	rsw->front_stencil_write_mask = mask;

	if( MALI_FALSE == _gles_fb_stencil_test_allowed( ctx ) )
	{
		mask = 0x0;
	}
	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_FRONT_WRITE_MASK, mask & GLES_MAX_STENCIL_MASK );
}

MALI_STATIC_INLINE void _gles_fb_init_back_stencil_mask( gles_context *ctx, u32 mask )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	rsw->back_stencil_write_mask = mask;

	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_BACK_WRITE_MASK, 0 );
}

MALI_STATIC_INLINE void _gles_fb_back_stencil_mask( gles_context *ctx, u32 mask )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	rsw->back_stencil_write_mask = mask;

	if( MALI_FALSE == _gles_fb_stencil_test_allowed( ctx ) )
	{
		mask = 0x0;
	}
	__m200_rsw_encode( &rsw->mirror, M200_RSW_STENCIL_BACK_WRITE_MASK, mask & GLES_MAX_STENCIL_MASK);
}

MALI_STATIC_INLINE void _gles_fb_set_stencil_test( gles_context *ctx, mali_bool flag )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	_gles_fb_enables_set( rsw, M200_STENCIL_TEST, flag );

	/* overloading of RSW means a stencil test toggle impacts all stencil related bits
	 */
	_gles_fb_front_stencil_func( ctx, rsw->front_stencil_func, rsw->front_stencil_ref, rsw->front_stencil_mask );
	_gles_fb_front_stencil_mask( ctx, rsw->front_stencil_write_mask );
	_gles_fb_front_stencil_op( ctx, rsw->front_stencil_sfail, rsw->front_stencil_zfail, rsw->front_stencil_zpass );
	_gles_fb_back_stencil_func( ctx, rsw->back_stencil_func, rsw->back_stencil_ref, rsw->back_stencil_mask );
	_gles_fb_back_stencil_mask( ctx, rsw->back_stencil_write_mask );
	_gles_fb_back_stencil_op( ctx, rsw->back_stencil_sfail, rsw->back_stencil_zfail, rsw->back_stencil_zpass );
}

MALI_STATIC_INLINE void _gles_fb_alpha_func_mali( gles_context *ctx, u8 func, u8 ref )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	rsw->alpha_func = func;
	rsw->alpha_ref  = ref;

	if( MALI_FALSE == _gles_fb_enables_get( rsw, M200_ALPHA_TEST ) )
	{
		func = M200_TEST_ALWAYS_SUCCEED;
	}

	__m200_rsw_encode( &rsw->mirror, M200_RSW_ALPHA_TEST_FUNC, func );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_ALPHA_TEST_REF_VALUE, ref );
}

MALI_STATIC_INLINE void _gles_fb_alpha_func( gles_context *ctx, u8 mali_func, GLclampf ref )
{
	const u8 mali_ref = _gles_fp16_to_fix8( _gles_fp32_to_fp16_predefined( ref ) );

	ctx->rsw_raster->opengl_alpha_ref = ref;

	_gles_fb_alpha_func_mali( ctx, mali_func, mali_ref );
}

MALI_STATIC_INLINE void _gles_fb_init_alpha_func( gles_context *ctx, u8 mali_func, GLclampf ref )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;
	const u8 mali_ref = _gles_fp16_to_fix8( _gles_fp32_to_fp16_predefined( ref ) );

	rsw->opengl_alpha_ref = ref;

	rsw->alpha_func = mali_func;
	rsw->alpha_ref  = mali_ref;

	__m200_rsw_encode( &rsw->mirror, M200_RSW_ALPHA_TEST_FUNC, M200_TEST_ALWAYS_SUCCEED );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_ALPHA_TEST_REF_VALUE, mali_ref );
}

MALI_STATIC_INLINE void _gles_fb_set_alpha_test( gles_context *ctx, mali_bool flag )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	_gles_fb_enables_set( rsw, M200_ALPHA_TEST, flag );

	_gles_fb_alpha_func_mali( ctx, rsw->alpha_func, rsw->alpha_ref );
}

/**
 * @return MALI_TRUE if multisampling is enabled and the current buffer supports multisampling.
 */
MALI_STATIC_FORCE_INLINE mali_bool _gles_fb_multisampling_allowed( gles_context *ctx )
{
	/* While multisampling may be set to one it can be overridden by the
	 * buffer samples or this being a FBO which does not support them.
	 */
	mali_bool has_bits = _gles_fbo_get_bits( ctx->state.common.framebuffer.current_object, GL_SAMPLE_BUFFERS ) > 0;
	return _gles_fb_enables_get( ctx->rsw_raster, M200_MULTISAMPLE ) && has_bits;
}

MALI_STATIC_INLINE void _gles_fb_init_sample_coverage( gles_context *ctx, mali_float coverage, mali_bool invert )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;
	u8 writemask = 0;

	MALI_DEBUG_ASSERT( (0 == invert) || (1 == invert), ("Non-boolean value given for invert") );

