NexellCorp/android_hal_pyrope/ogl_4330/src/opengles/m200_backend/gles_m200_rsw.h
	rsw->multisample_coverage = coverage;
	_gles_fb_enables_set( rsw, M200_RSW_MULTISAMPLE_INVERT, invert );

	if( coverage > 0.875f ) writemask |= 0x08;
	if( coverage > 0.625f ) writemask |= 0x04;
	if( coverage > 0.375f ) writemask |= 0x02;
	if( coverage > 0.125f ) writemask |= 0x01;

	/* Invert is a bitwise not operation, use a xor to ensure bits above the
	 * maximum mask size are not set.
	 */
	if( invert ) writemask ^= M200_RSW_MULTISAMPLE_WRITE_MASK_ALL;

	__m200_rsw_encode( &rsw->mirror, M200_RSW_MULTISAMPLE_WRITE_MASK, writemask );
}
MALI_STATIC_INLINE void _gles_fb_sample_coverage( gles_context *ctx, mali_float coverage, mali_bool invert )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;
	u8 writemask = 0;

	MALI_DEBUG_ASSERT( (0 == invert) || (1 == invert), ("Non-boolean value given for invert") );

	rsw->multisample_coverage = coverage;
	_gles_fb_enables_set( rsw, M200_RSW_MULTISAMPLE_INVERT, invert );

	if( MALI_FALSE == _gles_fb_multisampling_allowed( ctx ) ||
	    MALI_FALSE == _gles_fb_enables_get( rsw, M200_SAMPLE_COVERAGE ) )
	{
		coverage = 1.0f;
		invert = MALI_FALSE;
	}

	if( coverage > 0.875f ) writemask |= 0x08;
	if( coverage > 0.625f ) writemask |= 0x04;
	if( coverage > 0.375f ) writemask |= 0x02;
	if( coverage > 0.125f ) writemask |= 0x01;

	/* Invert is a bitwise not operation, use a xor to ensure bits above the
	 * maximum mask size are not set.
	 */
	if( invert ) writemask ^= M200_RSW_MULTISAMPLE_WRITE_MASK_ALL;

	__m200_rsw_encode( &rsw->mirror, M200_RSW_MULTISAMPLE_WRITE_MASK, writemask );
}

MALI_STATIC_INLINE void _gles_fb_multisampling( gles_context *ctx )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	const mali_bool enabled = _gles_fb_multisampling_allowed( ctx );

	__m200_rsw_encode( &rsw->mirror, M200_RSW_MULTISAMPLE_GRID_ENABLE,        enabled );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_MULTISAMPLED_ALPHA_TEST_ENABLE, enabled );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_MULTISAMPLED_Z_TEST_ENABLE,     enabled );
}

MALI_STATIC_INLINE void _gles_fb_set_sample_alpha_to_coverage( gles_context *ctx, mali_bool flag )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	_gles_fb_enables_set( rsw, M200_SAMPLE_ALPHA_TO_COVERAGE, flag );

	__m200_rsw_encode( &rsw->mirror, M200_RSW_SAMPLE_ALPHA_TO_COVERAGE, flag && _gles_fb_multisampling_allowed( ctx ) );
}

MALI_STATIC_INLINE void _gles_fb_set_sample_alpha_to_one( gles_context *ctx, mali_bool flag )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	_gles_fb_enables_set( rsw, M200_SAMPLE_ALPHA_TO_ONE, flag );

	__m200_rsw_encode( &rsw->mirror, M200_RSW_SAMPLE_ALPHA_TO_ONE, flag && _gles_fb_multisampling_allowed( ctx ) );
}

/* Multisample override per drawcall for GLES 1.1 point/line smooth.
 * Point/line smooth is enabled even if there are no additional sample buffers.
 */
MALI_STATIC_INLINE void _gles_fb_multisampling_deferred( gles_context *ctx, mali_bool is_point_type, mali_bool is_line_type )
{
#if MALI_USE_GLES_1
	IF_API_IS_GLES1(ctx->api_version)
	{
		mali_rsw_raster *rsw = ctx->rsw_raster;

		mali_bool multisample_mode = _gles_fb_multisampling_allowed( ctx );
		mali_bool smooth_mode =
			( is_point_type && _gles_fb_enables_get( rsw, M200_POINT_SMOOTH ) ) ||
			( is_line_type && _gles_fb_enables_get( rsw, M200_LINE_SMOOTH ) );

		__m200_rsw_encode( &rsw->mirror, M200_RSW_MULTISAMPLE_GRID_ENABLE, multisample_mode || smooth_mode );
		__m200_rsw_encode( &rsw->mirror, M200_RSW_SAMPLE_ALPHA_TO_COVERAGE, multisample_mode && _gles_fb_enables_get( rsw, M200_SAMPLE_ALPHA_TO_COVERAGE ) );
		__m200_rsw_encode( &rsw->mirror, M200_RSW_SAMPLE_ALPHA_TO_ONE, multisample_mode && _gles_fb_enables_get( rsw, M200_SAMPLE_ALPHA_TO_ONE ) );
	}
#endif
}

MALI_STATIC_INLINE void _gles_fb_set_sample_coverage( gles_context *ctx, mali_bool flag )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	_gles_fb_enables_set( rsw, M200_SAMPLE_COVERAGE, flag );

	_gles_fb_sample_coverage( ctx, rsw->multisample_coverage, _gles_fb_enables_get( rsw, M200_RSW_MULTISAMPLE_INVERT ) );
}

MALI_STATIC_INLINE void _gles_fb_set_multisample( gles_context *ctx, mali_bool flag )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	_gles_fb_enables_set( rsw, M200_MULTISAMPLE, flag );

	_gles_fb_multisampling( ctx );
	_gles_fb_sample_coverage( ctx, rsw->multisample_coverage, _gles_fb_enables_get( rsw, M200_RSW_MULTISAMPLE_INVERT ) );
	_gles_fb_set_sample_alpha_to_one( ctx, _gles_fb_enables_get( rsw, M200_SAMPLE_ALPHA_TO_ONE ) );
	_gles_fb_set_sample_alpha_to_coverage( ctx, _gles_fb_enables_get( rsw, M200_SAMPLE_ALPHA_TO_COVERAGE ) );
}

MALI_STATIC_INLINE void _gles_fb_set_point_smooth( gles_context *ctx, mali_bool flag )
{
	_gles_fb_enables_set( ctx->rsw_raster, M200_POINT_SMOOTH, flag );
}

MALI_STATIC_INLINE void _gles_fb_set_line_smooth( gles_context *ctx, mali_bool flag )
{
	_gles_fb_enables_set( ctx->rsw_raster, M200_LINE_SMOOTH, flag );
}

MALI_STATIC_INLINE void _gles_fb_init_set_dither( gles_context *ctx, mali_bool flag )
{
	_gles_fb_enables_set( ctx->rsw_raster, M200_RSW_DITHER, flag );
	
	_gles_fb_init_apply_dither( ctx, flag );
}


MALI_STATIC_INLINE void _gles_fb_set_dither( gles_context *ctx, mali_bool flag )
{
	_gles_fb_enables_set( ctx->rsw_raster, M200_RSW_DITHER, flag );
	
	_gles_fb_apply_dither( ctx, flag );
}

/* Called on context create, after which time fb state should remain valid with
 * only closed changes applied.
 */
MALI_STATIC_INLINE void _gles_fb_init( gles_context *ctx )
{
	mali_rsw_raster *rsw = ctx->rsw_raster;

	_mali_sys_memset( rsw, 0, sizeof( mali_rsw_raster ) );

	_gles_fb_init_set_dither( ctx, MALI_TRUE );

	_gles_fb_enables_set( rsw, M200_MULTISAMPLE, 1 );

	_gles_fb_init_sample_coverage( ctx, 1.0f, 0 );

	_gles_fb_init_depth_func( ctx, M200_TEST_LESS_THAN );
	_gles_fb_init_depth_mask( ctx, 1 );
	_gles_fb_depth_range( ctx, 0.0f, 1.0f );

	_gles_fb_color_mask( ctx, 1, 1, 1, 1 );

	_gles_fb_blend_equation( ctx, M200_BLEND_CsS_pCdD, M200_BLEND_CsS_pCdD );
	_gles_fb_init_blend_func( ctx, M200_RSW_BLEND_ONE, M200_RSW_BLEND_ZERO, M200_RSW_BLEND_ONE, M200_RSW_BLEND_ZERO );
	_gles_fb_blend_color( ctx, 0, 0, 0, 0, MALI_FALSE );

	_gles_fb_init_front_stencil_func( ctx, M200_TEST_ALWAYS_SUCCEED, 0, 0xFF );
	_gles_fb_init_front_stencil_op( ctx, M200_STENCIL_OP_KEEP_CURRENT, M200_STENCIL_OP_KEEP_CURRENT, M200_STENCIL_OP_KEEP_CURRENT );
	_gles_fb_init_front_stencil_mask( ctx, GLES_MAX_STENCIL_MASK );
	_gles_fb_init_back_stencil_func( ctx, M200_TEST_ALWAYS_SUCCEED, 0, 0xFF );
	_gles_fb_init_back_stencil_op( ctx, M200_STENCIL_OP_KEEP_CURRENT, M200_STENCIL_OP_KEEP_CURRENT, M200_STENCIL_OP_KEEP_CURRENT );
	_gles_fb_init_back_stencil_mask( ctx, GLES_MAX_STENCIL_MASK );

