NexellCorp/android_hal_pyrope/ogl_4330/src/opengles/m200_backend/gles_m200_rsw.h
	_gles_fb_init_alpha_func( ctx, M200_TEST_ALWAYS_SUCCEED, 0.0f );

	/* Constant non-zero RSW fields
	 */
	__m200_rsw_encode( &rsw->mirror, M200_RSW_RGB_RESULT_COLOR_CLAMP_0_1, 1 );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_ALPHA_RESULT_COLOR_CLAMP_0_1, 1 );

	__m200_rsw_encode( &rsw->mirror, M200_RSW_Z_FAR_DEPTH_BOUND_OP, M200_Z_BOUND_DISCARD );
	__m200_rsw_encode( &rsw->mirror, M200_RSW_Z_NEAR_DEPTH_BOUND_OP, M200_Z_BOUND_DISCARD );
}

/* This function changes the rasterisation behavior for internal mali buffers when
 * there is a change to the api level buffer configuration.
 */
MALI_STATIC_INLINE void _gles_fb_api_buffer_change( gles_context *ctx )
{
	/* The surface can modify the number of depth, stencil or alpha bits. Any of
	 * these changing to 0 disables pixel test operations related to these bits.
	 */
	_gles_fb_set_depth_test( ctx, _gles_fb_enables_get( ctx->rsw_raster, M200_DEPTH_TEST ) );
	_gles_fb_set_stencil_test( ctx, _gles_fb_enables_get( ctx->rsw_raster, M200_STENCIL_TEST ) );
	_gles_fb_set_blend( ctx, _gles_fb_enables_get( ctx->rsw_raster, M200_BLEND ) );

	/* As the surface type can also impact the multisampling settings, the rsw multisample
	 * settings are forced to update. This allows 0 sample surfaces to disable the setting
	 * if this context was used with a multisampled surface previously.
	 */
	_gles_fb_set_multisample( ctx, _gles_fb_enables_get( ctx->rsw_raster, M200_MULTISAMPLE ) );
}


/*
 * GL Gets additional functionality
 */

MALI_STATIC_INLINE mali_float _gles_fb_get_sample_coverage_value( gles_context *ctx )
{
	return ctx->rsw_raster->multisample_coverage;
}

MALI_STATIC_INLINE mali_bool _gles_fb_get_sample_coverage_invert( gles_context *ctx )
{
	return _gles_fb_enables_get( ctx->rsw_raster, M200_RSW_MULTISAMPLE_INVERT );
}

MALI_STATIC_INLINE mali_bool _gles_fb_get_sample_alpha_to_coverage( gles_context *ctx )
{
	return _gles_fb_enables_get( ctx->rsw_raster, M200_SAMPLE_ALPHA_TO_COVERAGE );
}

MALI_STATIC_INLINE mali_bool _gles_fb_get_sample_alpha_to_one( gles_context *ctx )
{
	return _gles_fb_enables_get( ctx->rsw_raster, M200_SAMPLE_ALPHA_TO_ONE );
}

MALI_STATIC_INLINE mali_bool _gles_fb_get_sample_coverage( gles_context *ctx )
{
	return _gles_fb_enables_get( ctx->rsw_raster, M200_SAMPLE_COVERAGE );
}

MALI_STATIC_INLINE mali_bool _gles_fb_get_multisample( gles_context *ctx )
{
	return _gles_fb_enables_get( ctx->rsw_raster, M200_MULTISAMPLE );
}

MALI_STATIC_INLINE mali_bool _gles_fb_get_depth_test( gles_context *ctx )
{
	return _gles_fb_enables_get( ctx->rsw_raster, M200_DEPTH_TEST );
}

MALI_STATIC_INLINE u8 _gles_fb_get_depth_func( gles_context *ctx )
{
	return ctx->rsw_raster->depth_func;
}

MALI_STATIC_INLINE u8 _gles_fb_get_logic_op_mode( gles_context *ctx )
{
	return ctx->rsw_raster->color_logic_op;
}

MALI_STATIC_INLINE mali_bool _gles_fb_get_color_logic_op( gles_context *ctx )
{
	return _gles_fb_enables_get( ctx->rsw_raster, M200_COLOR_LOGIC_OP );
}

MALI_STATIC_INLINE mali_bool _gles_fb_get_alpha_test( gles_context *ctx )
{
	return _gles_fb_enables_get( ctx->rsw_raster, M200_ALPHA_TEST );
}

MALI_STATIC_INLINE u8 _gles_fb_get_alpha_test_func( gles_context *ctx )
{
	return ctx->rsw_raster->alpha_func;
}

MALI_STATIC_INLINE mali_bool _gles_fb_get_dither( gles_context *ctx )
{
	return _gles_fb_enables_get( ctx->rsw_raster, M200_RSW_DITHER );
}

MALI_STATIC_INLINE mali_bool _gles_fb_get_blend( gles_context *ctx )
{
	return _gles_fb_enables_get( ctx->rsw_raster, M200_BLEND );
}

MALI_STATIC_INLINE u8 _gles_fb_get_blend_blend_equation_rgb( gles_context *ctx )
{
	return ctx->rsw_raster->blend_mode_rgb;
}

MALI_STATIC_INLINE u8 _gles_fb_get_blend_equation_alpha( gles_context *ctx )
{
	return ctx->rsw_raster->blend_mode_alpha;
}

MALI_STATIC_INLINE u8 _gles_fb_get_stencil_func( gles_context *ctx )
{
	return ctx->rsw_raster->front_stencil_func;
}

MALI_STATIC_INLINE u8 _gles_fb_get_stencil_back_func( gles_context *ctx )
{
	return ctx->rsw_raster->back_stencil_func;
}

MALI_STATIC_INLINE u8 _gles_fb_get_stencil_fail( gles_context *ctx )
{
	return ctx->rsw_raster->front_stencil_sfail;
}

MALI_STATIC_INLINE u8 _gles_fb_get_stencil_back_fail( gles_context *ctx )
{
	return ctx->rsw_raster->back_stencil_sfail;
}

MALI_STATIC_INLINE u8 _gles_fb_get_stencil_depth_pass( gles_context *ctx )
{
	return ctx->rsw_raster->front_stencil_zpass;
}

MALI_STATIC_INLINE u8 _gles_fb_get_stencil_back_depth_pass( gles_context *ctx )
{
	return ctx->rsw_raster->back_stencil_zpass;
}

MALI_STATIC_INLINE u8 _gles_fb_get_stencil_depth_fail( gles_context *ctx )
{
	return ctx->rsw_raster->front_stencil_zfail;
}

MALI_STATIC_INLINE u8 _gles_fb_get_stencil_back_depth_fail( gles_context *ctx )
{
	return ctx->rsw_raster->back_stencil_zfail;
}

MALI_STATIC_INLINE u32 _gles_fb_get_stencil_ref( gles_context *ctx )
{
	return ctx->rsw_raster->front_stencil_ref;
}
MALI_STATIC_INLINE u32 _gles_fb_get_stencil_back_ref( gles_context *ctx )
{
	return ctx->rsw_raster->back_stencil_ref;
}

MALI_STATIC_INLINE GLuint _gles_fb_get_stencil_value_mask( gles_context *ctx )
{
	return ctx->rsw_raster->opengl_front_stencil_mask;
}

MALI_STATIC_INLINE GLuint _gles_fb_get_stencil_back_value_mask( gles_context *ctx )
{
	return ctx->rsw_raster->opengl_back_stencil_mask;
}

MALI_STATIC_INLINE u32 _gles_fb_get_stencil_write_mask( gles_context *ctx )
{
	return ctx->rsw_raster->front_stencil_write_mask;
}

MALI_STATIC_INLINE u32 _gles_fb_get_stencil_back_write_mask( gles_context *ctx )
{
	return ctx->rsw_raster->back_stencil_write_mask;
}

MALI_STATIC_INLINE mali_bool _gles_fb_get_stencil_test( gles_context *ctx )
{
	return _gles_fb_enables_get( ctx->rsw_raster, M200_STENCIL_TEST );
}

MALI_STATIC_INLINE mali_bool _gles_fb_get_polygon_offset_fill( gles_context *ctx )
{
	return _gles_fb_enables_get( ctx->rsw_raster, M200_POLYGON_OFFSET_FILL );
}

MALI_STATIC_INLINE mali_bool _gles_fb_get_point_smooth( gles_context *ctx )
{
	return _gles_fb_enables_get( ctx->rsw_raster, M200_POINT_SMOOTH );
}

MALI_STATIC_INLINE mali_bool _gles_fb_get_line_smooth( gles_context *ctx )
{
	return _gles_fb_enables_get( ctx->rsw_raster, M200_LINE_SMOOTH );
}
/*
 * GL type gets for redundant storage from lossy rsw packing
 */

MALI_STATIC_INLINE GLenum _gles_fb_get_blend_src_rgb( gles_context *ctx )
{
	return ctx->rsw_raster->blend_src;
}

MALI_STATIC_INLINE GLenum _gles_fb_get_blend_dst_rgb( gles_context *ctx )
{
	return ctx->rsw_raster->blend_dst;
}

MALI_STATIC_INLINE GLenum _gles_fb_get_blend_src_alpha( gles_context *ctx )
{
	return ctx->rsw_raster->blend_alpha_src;
}

MALI_STATIC_INLINE GLenum _gles_fb_get_blend_dst_alpha( gles_context *ctx )
{
	return ctx->rsw_raster->blend_alpha_dst;
}

MALI_STATIC_INLINE GLclampf _gles_fb_get_blend_color_r( gles_context *ctx )
{
	return ctx->rsw_raster->opengl_blend_r;
}

MALI_STATIC_INLINE GLclampf _gles_fb_get_blend_color_g( gles_context *ctx )
{
	return ctx->rsw_raster->opengl_blend_g;
}

MALI_STATIC_INLINE GLclampf _gles_fb_get_blend_color_b( gles_context *ctx )
{
	return ctx->rsw_raster->opengl_blend_b;
}

MALI_STATIC_INLINE GLclampf _gles_fb_get_blend_color_a( gles_context *ctx )
{
	return ctx->rsw_raster->opengl_blend_a;
}

MALI_STATIC_INLINE GLclampf _gles_fb_get_alpha_test_ref( gles_context *ctx )
{
	return ctx->rsw_raster->opengl_alpha_ref;
}

MALI_STATIC_INLINE GLclampf _gles_fb_get_polygon_offset_factor( gles_context *ctx )
{
	return ctx->rsw_raster->opengl_polygon_offset_factor;
}

MALI_STATIC_INLINE GLclampf _gles_fb_get_polygon_offset_units( gles_context *ctx )
{
	return ctx->rsw_raster->opengl_polygon_offset_units;
}

#endif /* GLES_M200_RSW_H */
